// Написать программу, которая из имеющегося массива строк 
// сформирует массив из строк, длина которых меньше или равна 3 символам. 
// Первоначальный массив можно задать с клавиатуры, либо задать на старте выполнения алгоритма. 
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

// Examples:
// ["hello", "2", "world", ":-)"]  => ["2", ":-)"]
// ["1234", "1567", "-2", "computer science"]  => ["-2"]
// ["Russia", "Denmark", "-Kazan"]  => []

// * * * * * * * * * * * * * * * * * *
// For testing - please uncomment:
// string[] array1 = new string[] { "hello", "2", "world", ":-)" };
// string[] array2 = new string[] { "1234", "1567", "-2", "computer science" };
// string[] array3 = new string[] { "Russia", "Denmark", "Kazan" };


